ExecuteDERGroupsApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:der="http://www.epri.com/2016/DERGroupsMessage" xmlns:mes="http://www.iec.ch/TC57/2011/schema/message" xmlns:der1="http://www.epri.com/2013/DERGroups#">
  <soapenv:Body>
    <der:CreateDERGroups>
      <der:Header>
        <mes:Verb>?reply?</mes:Verb>
        <mes:Noun>?string?</mes:Noun>
        <!--Optional:-->
        <mes:Revision>?string?</mes:Revision>
        <!--Optional:-->
        <mes:ReplayDetection>
          <mes:Nonce>?string?</mes:Nonce>
          <mes:Created>?2007-10-26T02:36:28?</mes:Created>
        </mes:ReplayDetection>
        <!--Optional:-->
        <mes:Context>?string?</mes:Context>
        <!--Optional:-->
        <mes:Timestamp>?2004-02-14T13:44:14?</mes:Timestamp>
        <!--Optional:-->
        <mes:Source>?string?</mes:Source>
        <!--Optional:-->
        <mes:AsyncReplyFlag>?false?</mes:AsyncReplyFlag>
        <!--Optional:-->
        <mes:ReplyAddress>?string?</mes:ReplyAddress>
        <!--Optional:-->
        <mes:AckRequired>?false?</mes:AckRequired>
        <!--Optional:-->
        <mes:User>
          <mes:UserID>?string?</mes:UserID>
          <!--Optional:-->
          <mes:Organization>?string?</mes:Organization>
        </mes:User>
        <!--Optional:-->
        <mes:MessageID>?string?</mes:MessageID>
        <!--Optional:-->
        <mes:CorrelationID>?string?</mes:CorrelationID>
        <!--Optional:-->
        <mes:Comment>?string?</mes:Comment>
        <!--Zero or more repetitions:-->
        <mes:Property>
          <mes:Name>?string?</mes:Name>
          <!--Optional:-->
          <mes:Value>?string?</mes:Value>
        </mes:Property>
        <!--You may enter ANY elements at this point-->
        <AnyElement/>
      </der:Header>
      <!--Optional:-->
      <der:Request>
        <!--Optional:-->
        <mes:StartTime>?2009-05-16T08:42:28?</mes:StartTime>
        <!--Optional:-->
        <mes:EndTime>?2003-08-08T20:18:37-04:00?</mes:EndTime>
        <!--Zero or more repetitions:-->
        <mes:Option>
          <mes:name>?string?</mes:name>
          <!--Optional:-->
          <mes:value>?string?</mes:value>
        </mes:Option>
        <!--Zero or more repetitions:-->
        <mes:ID idType="?string?" idAuthority="?string?" kind="?transaction?" objectType="?string?">?string?</mes:ID>
        <!--You may enter ANY elements at this point-->
        <AnyElement/>
      </der:Request>
      <!--Optional:-->
      <der:Payload>
        <der1:DERGroups>
          <!--1 or more repetitions:-->
          <der1:EndDeviceGroup description="?anySimpleType?" comment="?anySimpleType?">
            <!--Optional:-->
            <der1:mRID>?string?</der1:mRID>
            <!--Zero or more repetitions:-->
            <der1:Names>
              <der1:name>?string?</der1:name>
              <!--Optional:-->
              <der1:NameType>
                <!--Optional:-->
                <der1:description>?string?</der1:description>
                <der1:name>?string?</der1:name>
                <!--Optional:-->
                <der1:NameTypeAuthority>
                  <!--Optional:-->
                  <der1:description>?string?</der1:description>
                  <der1:name>?string?</der1:name>
                </der1:NameTypeAuthority>
              </der1:NameType>
            </der1:Names>
            <!--Optional:-->
            <der1:CapabilityList>
              <!--Optional:-->
              <der1:currentActivePower>
                <der1:multiplier>?m?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:currentActivePower>
              <!--Optional:-->
              <der1:currentApparentPower>
                <der1:multiplier>?m?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:currentApparentPower>
              <!--Optional:-->
              <der1:currentReactivePower>
                <der1:multiplier>?m?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:currentReactivePower>
              <!--Optional:-->
              <der1:minActivePower>
                <der1:multiplier>?h?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:minActivePower>
              <!--Optional:-->
              <der1:minApparentPower>
                <der1:multiplier>?h?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:minApparentPower>
              <!--Optional:-->
              <der1:minReactivePower>
                <der1:multiplier>?m?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:minReactivePower>
              <!--Optional:-->
              <der1:maxActivePower>
                <der1:multiplier>?k?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:maxActivePower>
              <!--Optional:-->
              <der1:maxApparentPower>
                <der1:multiplier>?M?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:maxApparentPower>
              <!--Optional:-->
              <der1:maxReactivePower>
                <der1:multiplier>?k?</der1:multiplier>
                <der1:unit>?string?</der1:unit>
                <der1:value>?1.5E2?</der1:value>
              </der1:maxReactivePower>
            </der1:CapabilityList>
            <der1:Version>
              <der1:major>?100?</der1:major>
              <der1:minor>?100?</der1:minor>
              <der1:revision>?100?</der1:revision>
              <der1:versionDate>?2018-02-04T09:35:59-05:00?</der1:versionDate>
            </der1:Version>
            <!--Optional:-->
            <der1:Status>
              <der1:dateTime>?2002-11-16T04:03:57-05:00?</der1:dateTime>
              <!--Optional:-->
              <der1:reason>?string?</der1:reason>
              <!--Optional:-->
              <der1:remark>?string?</der1:remark>
              <der1:value>?string?</der1:value>
            </der1:Status>
            <!--Optional:-->
            <der1:name>?string?</der1:name>
            <!--Zero or more repetitions:-->
            <der1:EndDevice>
              <!--Optional:-->
              <der1:mRID>?string?</der1:mRID>
              <!--Optional:-->
              <der1:name>?string?</der1:name>
              <!--Optional:-->
              <der1:Names>
                <der1:name>?string?</der1:name>
                <!--Optional:-->
                <der1:NameType>
                  <!--Optional:-->
                  <der1:description>?string?</der1:description>
                  <der1:name>?string?</der1:name>
                  <!--Optional:-->
                  <der1:NameTypeAuthority>
                    <!--Optional:-->
                    <der1:description>?string?</der1:description>
                    <der1:name>?string?</der1:name>
                  </der1:NameTypeAuthority>
                </der1:NameType>
              </der1:Names>
              <!--Optional:-->
              <der1:CapabilityList>
                <!--Optional:-->
                <der1:currentActivePower>
                  <der1:multiplier>?da?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:currentActivePower>
                <!--Optional:-->
                <der1:currentApparentPower>
                  <der1:multiplier>?d?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:currentApparentPower>
                <!--Optional:-->
                <der1:currentReactivePower>
                  <der1:multiplier>?G?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:currentReactivePower>
                <!--Optional:-->
                <der1:minActivePower>
                  <der1:multiplier>?M?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:minActivePower>
                <!--Optional:-->
                <der1:minApparentPower>
                  <der1:multiplier>?c?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:minApparentPower>
                <!--Optional:-->
                <der1:minReactivePower>
                  <der1:multiplier>?h?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:minReactivePower>
                <!--Optional:-->
                <der1:maxActivePower>
                  <der1:multiplier>?da?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:maxActivePower>
                <!--Optional:-->
                <der1:maxApparentPower>
                  <der1:multiplier>?M?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:maxApparentPower>
                <!--Optional:-->
                <der1:maxReactivePower>
                  <der1:multiplier>?m?</der1:multiplier>
                  <der1:unit>?string?</der1:unit>
                  <der1:value>?1.5E2?</der1:value>
                </der1:maxReactivePower>
              </der1:CapabilityList>
            </der1:EndDevice>
            <!--Optional:-->
            <der1:extensionsList>
              <!--1 or more repetitions:-->
              <der1:extensionsItem>
                <der1:extName>?string?</der1:extName>
                <der1:extValue>?string?</der1:extValue>
                <!--Optional:-->
                <der1:extType>?string?</der1:extType>
              </der1:extensionsItem>
            </der1:extensionsList>
          </der1:EndDeviceGroup>
        </der1:DERGroups>
        <!--Optional:-->
        <der:OperationSet>
          <!--Optional:-->
          <mes:enforceMsgSequence>?false?</mes:enforceMsgSequence>
          <!--Optional:-->
          <mes:enforceTransactionalIntegrity>?true?</mes:enforceTransactionalIntegrity>
          <!--Zero or more repetitions:-->
          <mes:Operation>
            <mes:operationId>?100?</mes:operationId>
            <!--Optional:-->
            <mes:noun>?string?</mes:noun>
            <!--Optional:-->
            <mes:verb>?string?</mes:verb>
            <!--Optional:-->
            <mes:elementOperation>?false?</mes:elementOperation>
            <!--You may enter ANY elements at this point-->
            <AnyElement/>
          </mes:Operation>
        </der:OperationSet>
        <!--Optional:-->
        <der:Compressed>?string?</der:Compressed>
        <!--Optional:-->
        <der:Format>?string?</der:Format>
      </der:Payload>
    </der:CreateDERGroups>
  </soapenv:Body>
</soapenv:Envelope>